{
    "Recipes": [
        {
            "id": 1,
            "title": "Herby spring chicken pot pie",
            "preptime": 10,
            "cooktime": 30,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Minimise your washing-up with this delicious one-pan chicken pie with spinach and herbs and topped with crispy filo pastry. It's ideal for busy weeknights",
            "Nutrition": {
                "kcal": 526,
                "fat": 22,
                "saturates": 8,
                "carbs": 47,
                "sugars": 7,
                "fibre": 7,
                "protein": 32,
                "salt": 1.3
            },
            "Ingredients": [
                "2 tbsp olive oil , plus a little extra for brushing over the pastry",
                "bunch spring onions , sliced into 3cm pieces",
                "250g frozen spinach",
                "6 ready-cooked chicken thighs (or see tip, below)",
                "350ml hot chicken stock",
                "½ tbsp wholegrain mustard",
                "200g frozen peas",
                "200ml half-fat crème fraiche",
                "½ small bunch tarragon , leaves finely chopped",
                "small bunch parsley , finely chopped",
                "270g pack filo pastry"
            ], 
            "Method": [
                "Heat oven to 200C/180C fan/gas 6. Heat the oil in a large, shallow casserole dish on a medium heat. Add the spring onions and fry for 3 mins, then stir through the frozen spinach and cook for 2 mins or until it’s starting to wilt. Remove the skin from the chicken and discard. Shred the chicken off the bone and into the pan, and discard the bones. Stir through the stock and mustard. Bring to a simmer and cook, uncovered, for 5-10 mins.",
                "Stir in the peas, crème fraîche and herbs, then remove from the heat. Scrunch the filo pastry sheets over the mixture, brush with a little oil and bake for 15-20 mins or until golden brown."
            ]
        },
        {
            "id": 2,
            "title": "Mini bakewell tarts",
            "preptime": 30,
            "cooktime": 40,
            "complexity": "Easy",
            "serves": 12,
            "intruduction": "Use shop-bought pastry to make our easy bakewell tarts. Simply layer jam, frangipane and icing inside a shortcrust case for a nostalgic teatime treat",
            "Nutrition": {
                "kcal": 534,
                "fat": 30,
                "saturates": 12,
                "carbs": 57,
                "sugars": 32,
                "fibre": 2,
                "protein": 6,
                "salt": 0.5
            },
            "Ingredients": [
                "2 x 320g sheets of all butter shortcrust pastry",
                "20g butter, softened",
                "120g golden caster sugar",
                "1 egg",
                "1 tbsp plain flour",
                "110g ground almonds",
                "90g cherry jam",
                "200g icing sugar",
                "12 glacé cherries"
            ],
            "Method": [
                "Heat the oven to 180C/160C fan/gas 4. Lightly butter a 12 hole muffin tin. Unroll the sheet of pastry and use a 10cm circular pastry cutter to cut 12 circles out of the pastry sheet. Press the cut circles into the holes of the tin, making sure they come right up and slightly over the top – pushing out any creases. Chill the pastry in the fridge for 20mins. Scrunch up 10cm x 10cm squares of baking paper and then un-scrunch and use to line each of the pastry tarts, then fill with baking beans, rice or dried pulses. Bake for 10 mins, then remove the paper and beans and bake for 10 mins longer, until golden brown. Set aside to cool a little.",
                "Make the filling by beating together the butter and sugar until light and fluffy, then whisk in the egg, followed by the flour (the flour will prevent the mixture from splitting). Fold in the ground almonds. Spoon a level tsp of cherry jam into each of the pastry shells, followed by a tablespoon of the frangipane mixture. Bake for 20 mins, until the frangipane is golden and springy. Set aside to cool completely. Neaten the edges of the pastry with a small knife or scissors if you like.",
                "Mix the icing sugar with 2 tbsp water. Spread the icing over each of the tarts, top each with a glacé cherry, leave to set for 20 mins, then serve with tea."
            ]
        },
        {
            "id": 3,
            "title": "Lemon & buttermilk pound cake",
            "preptime": 25,
            "cooktime": 45,
            "complexity": "Easy",
            "serves": 12,
            "intruduction": "This buttermilk pound cake has a dense, moist crumb and bags of lemon flavour to cut through the richness. Make it for afternoon tea or for a summer picnic",
            "Nutrition": {
                "kcal": 291,
                "fat": 10,
                "saturates": 6,
                "carbs": 47,
                "sugars": 34,
                "fibre": 1,
                "protein": 4,
                "salt": 0.4
            },
            "Ingredients": [
                "125g butter, plus extra for the tin",
                "200g plain flour, plus extra for dusting",
                "¼ tsp bicarbonate of soda",
                "¼ tsp baking powder",
                "200g golden caster sugar",
                "4 lemons, finely zested (save a little for the top if you like)",
                "2 large eggs, at room temperature, lightly beaten",
                "100ml buttermilk, at room temperature",
                "½ lemon, juiced",
                "50g granulated sugar",
                "2 large lemons, juiced (use the lemons you’ve zested)",
                "150g icing sugar, sifted",
                "2-3 tbsp lemon juice"
            ],
            "Method": [
                "Heat oven to 180C/160C fan/gas 4. Butter and flour a loaf tin measuring 22 x 11 x 7cm. Sift the flour with a pinch of salt, bicarbonate of soda and baking powder. Beat the butter and sugar until pale and fluffy, then add the lemon zest. Gradually add the eggs a little at a time, beating well after each addition. Mix the buttermilk with the lemon juice. Fold the flour mixture into the batter, alternating with the buttermilk and lemon mixture.",
                "Scrape the batter into the loaf tin and bake for 40-45 mins, or until a skewer inserted into the centre of the cake comes out clean. Leave to sit for 10 mins, then turn out onto a wire cooling rack with a tray underneath it. Set the cake the right way up.",
                "To make the syrup, put the ingredients in a small saucepan and heat until the sugar has dissolved. Pierce the cake all over with a skewer then, while the cake is still warm, pour the syrup over slowly. Leave to cool.",
                "Gradually add the lemon juice to the icing sugar and mix until just smooth. If runny, put in the fridge for about 10 mins – you don’t want it to set, you just want it become a little firmer. Pour or spread the icing over the cake (the bits that drizzle down the side will be caught by the tray under the cooling rack). This icing won’t set hard, but do leave it to set a little before serving."
            ]
        },
        {
            "id": 4,
            "title": "Spring chicken in a pot",
            "preptime": 20,
            "cooktime": 45,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Casseroles aren't just for winter  this light, vibrant one-pot is packed with spring veg and herby pesto",
            "Nutrition": {
                "kcal": 339,
                "fat": 10,
                "saturates": 3,
                "carbs": 27,
                "sugars": 12,
                "fibre": 8,
                "protein": 36,
                "salt": 0.5
            },
            "Ingredients": [
                "1 tbsp olive oil",
                "1 onion , chopped",
                "500g boneless, skinless chicken thigh",
                "300g small new potato",
                "425ml low-salt vegetable stock (such as Kallo low-salt vegetable stock cubes)",
                "350g broccoli , cut into small florets",
                "350g spring green , shredded",
                "140g petits pois",
                "bunch spring onion , sliced",
                "2 tbsp pesto"
            ],
            "Method": [
                "Heat the oil in a large, heavy pan. Add the onion, gently fry for 5 mins until softened, add the chicken, then fry until lightly coloured. Add the potatoes, stock and plenty of freshly ground black pepper, then bring to the boil. Cover, then simmer for 30 mins until the potatoes are tender and the chicken is cooked. Can be frozen at this point.",
                "Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through."
            ]
        },
        {
            "id": 5,
            "title": "Healthy Easter lamb",
            "preptime": 30,
            "cooktime": 55,
            "complexity": "Easy",
            "serves": 10,
            "intruduction": "Try a lighter take on roast lamb with this healthy Easter centrepiece. A trimmed leg of lamb is served with vibrant spring vegetables tossed in herbs and lemon",
            "Nutrition": {
                "kcal": 439,
                "fat": 17,
                "saturates": 5,
                "carbs": 15,
                "sugars": 6,
                "fibre": 12,
                "protein": 49,
                "salt": 0.37
            },
            "Ingredients": [
                "2 onions , peeled and thickly sliced",
                "2 large carrots , thickly sliced",
                "boneless leg of lamb (around 1.5kg), trimmed of excess fat",
                "4 garlic cloves , sliced",
                "3 rosemary sprigs , leaves picked",
                "2 tbsp olive oil",
                "800g baby carrots , peeled",
                "500g frozen broad beans",
                "600g frozen peas",
                "small bunch mint , finely chopped",
                "small bunch parsley , finely chopped",
                "1 lemon , zested and juiced"
            ],
            "Method": [
                "Heat the oven to 200C/180C fan/gas 6. Put the onions and sliced carrots in a large roasting tray. Remove any string from the lamb and put it on top of the veg, skin-side up. Pierce the lamb with the tip of a knife to make small pockets in the meat, add garlic slices and a few rosemary leaves to the holes. Rub the lamb with 1 tbsp olive oil and season. Pour 100ml water into the tray.",
                "Roast uncovered for 45 minutes at the top of the oven. Check the internal temperature, it should read 60C for medium (pink). Cook for another 15 minutes for well done. Rest the meat under foil for 10 mins while you cook the veg. ",
                "Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through.",
                "Bring a large pan of salted water to the boil. Add the carrots, and cook for 8 minutes until tender, adding the peas and beans for the last 2 minutes. Drain the veg and toss with 1 tbsp oil, chopped herbs, lemon zest and juice. Season to taste. ",
                "Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through.",
                "Carve the lamb into thin slices. Spread the veg onto a large warmed serving platter and arrange the meat in the middle. "
            ]
        },
        {
            "id": 6,
            "title": "Ham hock & cabbage hash",
            "preptime": 15,
            "cooktime": 35,
            "complexity": "Easy",
            "serves": 5,
            "intruduction": "A hearty bowl of comfort that's low fat and cheap to boot",
            "Nutrition": {
                "kcal": 263,
                "fat": 7,
                "saturates": 3,
                "carbs": 40,
                "sugars": 5,
                "fibre": 5,
                "protein": 14,
                "salt": 0.88
            },
            "Ingredients": [
                "1kg potato , unpeeled and cut into cubes",
                "25g butter",
                "½ Savoy cabbage , shredded",
                "1 onion , thinly sliced",
                "100ml low-sodium vegetable stock",
                "175g ham hock, shredded",
                "baked beans and your favourite sauce, to serve"
            ],
            "Method": [
                "Cook the potatoes in a large pan of salted water until tender, drain, then allow to steam dry for about 3 mins",
                "Meanwhile, melt half the butter in a large non-stick frying pan, then throw in the cabbage and onion and fry for 2 mins. Add the stock and cook for 5 mins more until the veg is starting to soften. Stir in the ham and potatoes and push down in the pan to flatten slightly. Cook for 8 mins until the base is golden and crisp.",
                "Heat the grill. Dot the remaining butter on top of the hash, then flash under the grill until golden and crisp. Serve with baked beans and brown sauce or ketchup, if you like."
            ]
        },
        {
            "id": 7,
            "title": "Puffed salmon & spinach fish pie",
            "preptime": 15,
            "cooktime": 60,
            "complexity": "More effort",
            "serves": 6,
            "intruduction": "Adding greens to your mashed potato topping boosts the health benefits of this classic comfort food bake",
            "Nutrition": {
                "kcal": 449,
                "fat": 18,
                "saturates": 6,
                "carbs": 37,
                "sugars": 5,
                "fibre": 6,
                "protein": 33,
                "salt": 0.8
            },
            "Ingredients": [
                "1kg Maris Piper potato , cut into large chunks",
                "2 large eggs , separated",
                "400g frozen whole-leaf spinach (frozen weight), defrosted and squeezed dry",
                "85g reduced-fat mature cheddar",
                "whole nutmeg , for grating",
                "500g fish - a mix of white and salmon is good (I used 2 frozen salmon fillets and 2 cod, defrosted)",
                "1 onion , halved",
                "a few whole cloves",
                "1 fresh or dried bay leaf",
                "300ml semi-skimmed milk",
                "300ml fish stock (from a cube is fine)",
                "25g butter",
                "2 tbsp extra-virgin olive oil",
                "50g plain flour",
                "1 tsp wholegrain mustard"
            ],
            "Method": [
                "Boil the potatoes for 20 mins until tender. Meanwhile, put the fish in a frying pan, skin-side down. Stud the onion with the cloves and put into the pan with the bay, milk and stock. Bring to the boil, then cover and simmer for 2 mins. Remove the cod, which should flake easily, then re-cover and cook for 3 mins more until the salmon is just cooked through. Lift out the fish and set aside. Strain the cooking liquid.",
                "In another pan, melt the butter with the oil, stir in the flour and cook for 2 mins until it smells toasty. Take off the heat and slowly whisk in the fish cooking liquid. Return to the heat, whisk until the sauce boils and thickens, then stir in the mustard. Heat oven to 180C/160C fan/gas 4.",
                "Drain and mash the potatoes until smooth, then beat in the egg yolks, spinach and most of the cheese. Season generously with salt, pepper and nutmeg. Whisk the egg whites to soft peaks, then fold into the potato in 2 batches.",
                "Flake the fish into a large baking dish, pour over the sauce and top with the spinachy potato. Scatter with the rest of the cheese and bake for 35-40 mins until golden and risen."
            ]
        },
        {
            "id": 8,
            "title": "Chicken & chorizo ragu",
            "preptime": 15,
            "cooktime": 40,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Serve this delicious chicken and chorizo ragu over rice or pasta as an easy midweek dinner for the family. You can freeze any leftovers for another day",
            "Nutrition": {
                "kcal": 383,
                "fat": 15,
                "saturates": 5,
                "carbs": 16,
                "sugars": 14,
                "fibre": 5,
                "protein": 44,
                "salt": 1.5
            },
            "Ingredients": [
                "120g cooking chorizo, chopped",
                "1 red onion, chopped",
                "2 garlic cloves, grated",
                "1 tsp hot smoked paprika",
                "80g sundried tomatoes, roughly chopped",
                "600g skinless and boneless chicken thighs",
                "400g can chopped tomatoes",
                "100ml chicken stock",
                "1 lemon, juiced",
                "jacket potatoes, chopped parsley and soured cream, to serve (optional)"
            ],
            "Method": [
                "Fry the chorizo over a medium heat in a large saucepan or flameproof casserole dish for 5 mins or until it releases its oil and starts to char at the edges. Add the onion and fry for 5 mins more or until soft. Tip in the garlic and cook for 2 mins before stirring in the paprika and sundried tomatoes. Add the chicken thighs and fry for 2 mins each side until they are well coated in the spices and beginning to brown.",
                "Pour in the chopped tomatoes and stock, and turn the heat down. Cover and cook for 40 mins until the chicken is falling apart and the sauce is thick. Stir the lemon juice through. Serve by piling spoonfuls of the ragu into hot jacket potatoes with parsley sprinkled over and a dollop of soured cream, if you like"
            ]
        },
        {
            "id": 9,
            "title": "Herby fish fingers with Chinese-style rice",
            "preptime": 10,
            "cooktime": 35,
            "complexity": "Easy",
            "serves": 2,
            "intruduction": "This healthy, gluten-free lunch or dinner supplies a balance of carbs and protein, making it perfect for refuelling after exercise",
            "Nutrition": {
                "kcal": 487,
                "fat": 14,
                "saturates": 2,
                "carbs": 47,
                "sugars": 7,
                "fibre": 7,
                "protein": 40,
                "salt": 1.14
            },
            "Ingredients": [
                "100g brown basmati rice",
                "160g frozen peas",
                "50g French beans",
                "3 spring onions , finely chopped",
                "½ tsp dried chilli flakes",
                "good handful coriander , roughly chopped",
                "2 tsp tamari",
                "few drops sesame oil",
                "1 tbsp cold-pressed rapeseed oil",
                "2 large eggs",
                "280g pack skinless cod loins cut into chunky strips (cut into 4 strips per loin)"
            ],
            "Method": [
                "Cook the rice in a pan of water for 25 mins, adding the peas and beans for the last 6 mins. Drain, then return to the pan and stir in the spring onions, chilli flakes, all but 1 tbsp chopped coriander, the tamari and sesame oil. Cover.",
                "Meanwhile, heat a large non-stick pan with the rapeseed oil Beat the eggs with the remaining 1 tbsp coriander. Cut the fish into chunky strips, then coat them in the egg and fry in the oil for a couple of mins each side until golden. Remove the fish from the pan and tip in the rice with any remaining egg and stir. Serve in bowls, topped with the fish."
            ]
        },
        {
            "id": 10,
            "title": "Meatball & garlic bread traybake",
            "preptime": 10,
            "cooktime": 50,
            "complexity": "Easy",
            "serves": 3,
            "intruduction": "Make this comforting meatball and garlic bread traybake for a dinner the whole family will enjoy. You could buy a pack of meatballs if you’re short on time",
            "Nutrition": {
                "kcal": 565,
                "fat": 28,
                "saturates": 13,
                "carbs": 34,
                "sugars": 19,
                "fibre": 6,
                "protein": 42,
                "salt": 1.3
            },
            "Ingredients": [
                "350g turkey thigh mince",
                "1 tsp dried oregano",
                "1 tsp fennel seeds",
                "1½ tbsp olive oil",
                "1 large onion, chopped",
                "3 garlic cloves, crushed",
                "1 tbsp tomato purée",
                "2 x 400g cans chopped tomatoes",
                "2 tsp sugar",
                "150g ball mozzarella, torn into pieces",
                "4 garlic breadsticks or garlic bread slices, torn or chopped into chunks",
                "25g cheddar, grated",
                "green salad or spaghetti, to serve"
            ],
            "Method": [
                "Combine the mince, oregano, fennel seeds and some seasoning in a bowl. Take walnut-sized pieces of the mixture and roll into balls. Heat half the oil in a large, shallow ovenproof pan and cook the meatballs until browned all over – don’t worry if they’re not cooked through. Transfer to a plate. Heat the oven to 200C/180C fan/gas 6.",
                "Heat the remaining oil in the pan and add the onion. Cook until softened, about 10-12 mins, stirring regularly. Stir in the garlic for another minute, then the tomato purée, chopped tomatoes and sugar.",
                "Simmer for 10-15 mins, then season to taste. Place the meatballs on top of the sauce, then add the mozzarella, garlic bread and the cheddar on top. Bake for 15-20 mins until golden and crisp."
            ]
        },
        {
            "id": 11,
            "title": "Beef & vegetable casserole",
            "preptime": 15,
            "cooktime": 230,
            "complexity": "Easy",
            "serves": 5,
            "intruduction": "A traditional braised beef stew with thick, rich gravy – an ideal recipe for cheap cuts, as slow-cooking guarantees a tender dish",
            "Nutrition": {
                "kcal": 483,
                "fat": 32.6,
                "saturates": 13.4,
                "carbs": 14.3,
                "sugars": 7.4,
                "fibre": 2.3,
                "protein": 33.7,
                "salt": 1.6
            },
            "Ingredients": [
                "2 celery sticks, thickly sliced",
                "1 onion, chopped",
                "2 really big carrots, halved lengthways then very chunkily sliced",
                "5 bay leaves",
                "2 thyme sprigs, 1 whole and 1 leaves picked",
                "1 tbsp vegetable oil",
                "1 tbsp butter",
                "2 tbsp plain flour",
                "2 tbsp tomato purée",
                "2 tbsp Worcestershire sauce",
                "2 beef stock cubes, crumbled",
                "850g stewing beef (featherblade or brisket works nicely), cut into nice large chunks"
            ],
            "Method": [
                "Heat oven to 160C/140C fan/gas 3 and put the kettle on.",
                "Put 2 thickly sliced celery sticks, 1 chopped onion, 2 chunkily sliced carrots, 5 bay leaves and 1 whole thyme sprig in a flameproof casserole dish with 1 tbsp vegetable oil and 1 tbsp butter.",
                "Soften for 10 mins, then stir in 2 tbsp plain flour until it doesn’t look dusty anymore, followed by 2 tbsp tomato purée, 2 tbsp Worcestershire sauce and 2 crumbled beef stock cubes.",
                "Gradually stir in 600ml hot water, then tip in 850g stewing beef and bring to a gentle simmer.",
                "Cover and put in the oven for 2hrs 30 mins, then uncover and cook for 30mins – 1hr more until the meat is really tender and the sauce is thickened.",
                "Garnish with the picked leaves of the remaining thyme sprig."
            ]
        },
        {
            "id": 12,
            "title": "Beef goulash",
            "preptime": 20,
            "cooktime": 150,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Make this hearty beef goulash to feed the family on chilly nights. Stir in the soured cream and parsley for an indulgent, crowd-pleasing supper",
            "Nutrition": {
                "kcal": 576,
                "fat": 32,
                "saturates": 12,
                "carbs": 18,
                "sugars": 11,
                "fibre": 6,
                "protein": 46,
                "salt": 0.45
            },
            "Ingredients": [
                "4 tbsp olive oil",
                "700g stewing steak, cut into chunks",
                "30g plain flour",
                "1 large onion, thinly sliced",
                "2 garlic cloves, finely chopped",
                "1 green pepper, deseeded and thinly sliced",
                "1 red pepper, deseeded and thinly sliced",
                "2 tbsp tomato purée",
                "2 tbsp paprika",
                "2 large tomatoes, diced",
                "75ml dry white wine",
                "300ml beef stock, homemade or shop-bought",
                "2 tbsp flat-leaf parsley leaves",
                "150ml soured cream"
            ],
            "Method": [
                "Heat oven to 160C/140C fan/gas 3",
                "Heat 1 tbsp olive oil in a flameproof casserole dish or heavy-based saucepan. Sprinkle 700g stewing steak chunks with 30g plain flour and brown well in three batches, adding an extra 1 tbsp oil for each batch. Set the browned meat aside.",
                "Add in the remaining 1 tbsp oil to the casserole dish, followed by 1 large thinly sliced onion, 2 finely chopped garlic cloves, 1 green pepper and 1 red pepper, both finely sliced. Fry until softened, around 5-10 mins.",
                "Return the beef to the pan with 2 tbsp tomato purée and 2 tbsp paprika. Cook, stirring, for 2 mins.",
                "Add in 2 large diced tomatoes, 75ml dry white wine and 300ml beef stock. Cover and bake in the oven for 1 hr 30 mins - 2 hrs. Alternatively, cover and cook it on the hob on a gentle heat for about an hour, removing the lid after 45 mins.",
                "Sprinkle over 2 tbsp flat-leaf parsley leaves and season well with salt and freshly ground pepper. Stir in 150ml soured cream and serve."
            ]
        },
        {
            "id": 13,
            "title": "Chinese-style braised beef one-pot",
            "preptime": 10,
            "cooktime": 150,
            "complexity": "Easy",
            "serves": 6,
            "intruduction": "Great for casual entertaining, when you fancy a warming beef stew but with some more vibrant flavours",
            "Nutrition": {
                "kcal": 513,
                "fat": 29,
                "saturates": 10,
                "carbs": 9,
                "sugars": 4,
                "fibre": 0,
                "protein": 54,
                "salt": 2.39
            },
            "Ingredients": [
                "3-4 tbsp olive oil",
                "6 garlic cloves, thinly sliced",
                "good thumb-size piece fresh root ginger, peeled and shredded",
                "1 bunch spring onions, sliced",
                "1 red chilli, deseeded and thinly sliced",
                "1 ½kg braising beef, cut into large pieces (we used ox cheek)",
                "2 tbsp plain flour, well seasoned",
                "1 tsp Chinese five-spice powder",
                "2 star anise (optional)",
                "2 tsp light muscovado sugar (or use whatever you've got)",
                "3 tbsp Chinese cooking wine or dry sherry",
                "3 tbsp dark soy sauce, plus more to serve",
                "500ml beef stock (we used Knorr Touch of Taste)",
                "steamed bok choi and steamed basmati rice, to serve"
            ],
            "Method": [
                "Heat 2 tbsp of the oil in a large, shallow casserole. Fry the garlic, ginger, onions and chilli for 3 mins until soft and fragrant. Tip onto a plate. Toss the beef in the flour, add 1 tbsp more oil to the pan, then brown the meat in batches, adding the final tbsp oil if you need to. It should take about 5 mins to brown each batch properly.",
                "Add the five-spice and star anise (if using) to the pan, tip in the gingery mix, then fry for 1 min until the spices are fragrant. Add the sugar, then the beef and stir until combined. Keep the heat high, then splash in the wine or sherry, scraping up any meaty bits. Heat oven to 150C/fan 130C/gas 2.",
                "Pour in the soy and stock (it won’t cover the meat completely), bring to a simmer, then tightly cover, transfer to the oven and cook for 1½-2 hrs, stirring the meat halfway through. The meat should be very soft, and any sinewy bits should have melted away. Season with more soy. This can now be chilled and frozen for up to 1 month.",
                "Nestle the cooked bok choi into the pan, then bring to the table with the basmati rice straight away and tuck in."
            ]
        },
        {
            "id": 14,
            "title": "Lamb bhuna",
            "preptime": 30,
            "cooktime": 100,
            "complexity": "More effort",
            "serves": 4,
            "intruduction": "Make this stunning lamb bhuna a day or two ahead of a big family feast – slow-cooked curries are better when the flavours have time to develop",
            "Nutrition": {
                "kcal": 455,
                "fat": 31,
                "saturates": 10,
                "carbs": 12,
                "sugars": 9,
                "fibre": 4,
                "protein": 31,
                "salt": 0.55
            },
            "Ingredients": [
                "600g lamb neck fillet or shoulder, cut into large chunks",
                "6 garlic cloves, finely grated",
                "thumb-sized piece of ginger, peeled and finely grated",
                "2 tbsp malt vinegar",
                "½ tsp ground cinnamon",
                "1 tbsp sunflower oil",
                "3 tbsp sunflower oil, plus a little extra if needed",
                "2 onions, finely chopped",
                "10 curry leaves",
                "2 dried chillies, or ½ tsp chilli flakes",
                "1 tsp cumin seeds",
                "1 tsp mustard seeds",
                "1 tsp ground coriander",
                "½ tsp fenugreek seeds or ground fenugreek",
                "1 tbsp tomato purée",
                "400g can chopped tomatoes",
                "1 tsp garam masala"
            ],
            "Method": [
                "To make the marinade, combine the ingredients with a large pinch of salt in a large bowl. Toss in the lamb, cover and marinate for 1 hr at room temperature, or chill overnight.",
                "For the sauce, heat the oil in a flameproof casserole and fry the onions for 10 mins, stirring until soft and golden. Drizzle in more oil if the pan gets dry. Add the curry leaves and chillies and fry for a few minutes, then add the spices and cook for 5 mins more until the onions start to caramelise.",
                "Tip in the lamb along with the marinade and turn the heat to high. Cook, stirring, for 5 mins until the lamb browns. Add the tomato purée and cook for 1 min, then stir in the tomatoes and 100ml water. Bring to a simmer, reduce the heat, cover and cook, stirring now and then, for 1 hr 20 mins until the lamb is tender.",
                "Uncover and cook for 8-10 mins more until the sauce has reduced and thickened. Remove from the heat, stir in the garam marsala and season. Will keep chilled for up to three days or frozen for two months."
            ]
        },
        {
            "id": 15,
            "title": "Braised pork with plums",
            "preptime": 25,
            "cooktime": 120,
            "complexity": "Easy",
            "serves": 8,
            "intruduction": "Meltingly tender meat in a spicy, fruity sauce, this meal is guaranteed to impress",
            "Nutrition": {
                "kcal": 530,
                "fat": 36,
                "saturates": 13,
                "carbs": 11,
                "sugars": 10,
                "fibre": 1,
                "protein": 40,
                "salt": 2.87
            },
            "Ingredients": [
                "about 1.6kg/3lb 8oz pork shoulder",
                "5 tbsp rice wine",
                "5 tbsp light soy sauce for flavour, 1 tbsp dark for colour",
                "generous thumb-size piece fresh root ginger",
                "5 garlic cloves",
                "1 red chilli , deseeded and finely chopped",
                "2 tbsp vegetable oil",
                "bunch spring onions , finely sliced",
                "2 star anise",
                "1 ½ tsp five-spice powder",
                "1 cinnamon stick",
                "2 tbsp sugar , any type",
                "1 tbsp tomato purée",
                "500ml chicken stock",
                "6 ripe plums , halved and stoned"
            ],
            "Method": [
                "Cut the pork into big pieces about the length of your thumb and twice as wide. Put into a bowl or food bag, and add the wine, soy sauces, half the ginger, half the garlic and half the chilli. Marinate for at least 1 hr or up to 24 hrs.",
                "Heat oven to 160C/140C fan/gas 3, then heat the oil in a large casserole. Tip in half the spring onions, remaining ginger and garlic, the star anise, five-spice powder and cinnamon. Fry gently until fragrant and soft. Stir in the sugar, turn up the heat, then lift the pork from the marinade and turn in the oniony mix for about 3 mins until the meat is just sealed but not browned. Tip in the marinade, tomato purée and stock, give it a stir, cover, then braise in the oven for 2 hrs.",
                "After the first hr is up, add the plums to the pan. Take the lid off and carry on the cooking, uncovered. The meat should be completely tender, turning golden brown where it breaks the surface of the sauce. Spoon off any excess fat from the surface, then scoop the meat and plums carefully from the pan with a slotted spoon. Turn up the heat and boil the sauce for 5-10 mins until reduced and slightly syrupy. Return everything to the pan, gently warm through, then scatter the rest of the spring onions over the top to serve."
            ]
        },
        {
            "id": 16,
            "title": "Easy huevos rancheros",
            "preptime": 3,
            "cooktime": 7,
            "complexity": "Easy",
            "serves": 1,
            "intruduction": "An easy Mexican breakfast that'll keep you going all morning, it's got everything you need to pep up your plate",
            "Nutrition": {
                "kcal": 682,
                "fat": 46,
                "saturates": 13,
                "carbs": 32,
                "sugars": 1,
                "fibre": 13,
                "protein": 27,
                "salt": 2.1
            },
            "Ingredients": [
                "1 tbsp vegetable oil or sunflower oil",
                "1 corn tortilla wrap",
                "1 egg",
                "200g can black beans, drained",
                "juice ½ lime",
                "½ ripe avocado, peeled and sliced",
                "50g feta, crumbled",
                "hot chilli sauce (we like sriracha)"
            ],
            "Method": [
                "Heat the oil in a frying pan over a high heat. Add the tortilla and fry for 1-2 mins on each side until crisping at the edges. Transfer to a plate.",
                "Crack the egg into the pan and cook to your liking. Meanwhile, tip the beans into a bowl, season and add a squeeze of lime, then lightly mash with a fork.",
                "Spread the beans over the tortilla, top with the egg, avocado, feta and chilli sauce. Squeeze over a little more lime juice just before eating."
            ]
        },
        {
            "id": 17,
            "title": "Minestrone in minutes",
            "preptime": 2,
            "cooktime": 8,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Whip up a hearty bowl of soup in next to no time, perfect for a quick lunch or warming supper",
            "Nutrition": {
                "kcal": 162,
                "fat": 2,
                "saturates": 0,
                "carbs": 30,
                "sugars": 8,
                "fibre": 6,
                "protein": 8,
                "salt": 0.54
            },
            "Ingredients": [
                "1l hot vegetable stock",
                "400g tin chopped tomato",
                "100g thin spaghetti , broken into short lengths",
                "350g frozen mixed vegetable",
                "4 tbsp pesto",
                "drizzle of olive oil",
                "coarsely grated vegetarian parmesan-style cheese , to serve"
            ],
            "Method": [
                "Bring the stock to the boil with the tomatoes, then add the spaghetti and cook for 6 mins or until done. A few minutes before the pasta is ready, add the vegetables and bring back to the boil. Simmer for 2 mins until everything is cooked.",
                "Serve in bowls drizzled with pesto and oil, sprinkled with parmesan."
            ]
        },
        {
            "id": 18,
            "title": "Panuozzo sandwich",
            "preptime": 20,
            "cooktime": 12,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Make your own baguettes and pesto to make these pizza-inspired sandwiches for the whole family. They're surprisingly quick and easy to make and are great for lunch or a light dinner",
            "Nutrition": {
                "kcal": 162,
                "fat": 2,
                "saturates": 0,
                "carbs": 30,
                "sugars": 8,
                "fibre": 6,
                "protein": 8,
                "salt": 0.54
            },
            "Ingredients": [
                "300g strong white bread flour, plus extra for dusting",
                "3g (about half a sachet) fast-action dried yeast",
                "1 tbsp olive oil",
                "1 tomato, halved and sliced",
                "4 slices cooked ham",
                "150g mozzarella ball, sliced and seasoned",
                "small handful of rocket (optional)",
                "6 tbsp pesto (see below for the recipe)",
                "1 tbsp olive oil"
            ],
            "Method": [
                "Put the flour in a large bowl, then stir in the yeast and a large pinch of salt. Make a well in the centre, pour in 175ml warm water and the oil and bring together with a wooden spoon to make a soft, fairly wet dough. Turn out onto a lightly floured surface and knead for 5-8 mins until smooth. Divide the dough into four balls and arrange on a floured tray, well spaced apart. Cover with a tea towel and set aside for about 40 mins-1 hr until doubled in size",
                "Heat the oven to 240C/220C fan/gas 8 and put a baking tray in the oven to heat up. Roll the dough balls out on a floured surface into long baguette sticks about 22-25cm long, place on the hot tray and bake for 10-12 mins until puffed up and golden, then leave to cool. Can be made a few hours ahead of baking.",
                "To assemble, split the bread down one side and neatly layer in the tomato, ham, mozzarella and rocket, if using. Mix the pesto with the olive oil, drizzle over, halve and serve."
            ]
        },
        {
            "id": 19,
            "title": "Easy teriyaki chicken",
            "preptime": 5,
            "cooktime": 15,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Try this easy, sticky Asian-style teriyaki chicken for a speedy weeknight supper – it takes just 20 minutes to make! Serve it with sticky rice and steamed greens",
            "Nutrition": {
                "kcal": 243,
                "fat": 14,
                "saturates": 3,
                "carbs": 11,
                "sugars": 11,
                "fibre": 1,
                "protein": 18,
                "salt": 1.23
            },
            "Ingredients": [
                "2 tbsp toasted sesame oil",
                "6 skinless and boneless chicken thighs, sliced",
                "2 large garlic cloves, crushed",
                "1 thumb-sized piece ginger, grated",
                "50g runny honey",
                "30ml light soy sauce",
                "1 tbsp rice wine vinegar",
                "1 tbsp sesame seeds , to serve",
                "4 spring onions, shredded, to serve",
                "sticky rice, to serve",
                "steamed bok choi or spring greens, to serve"
            ],
            "Method": [
                "Heat the oil in a non-stick pan over a medium heat. Add the chicken and fry for 7 mins, or until golden. Add the garlic and ginger and fry for 2 mins. Stir in the honey, soy sauce, vinegar and 100ml water. Bring to the boil and cook for 2 - 5 mins over a medium heat until the chicken is sticky and coated in a thick sauce.",
                "Scatter over the spring onions and sesame seeds, then serve the chicken with the rice and steamed veg."
            ]
        },
        {
            "id": 20,
            "title": "Easy Thai prawn curry",
            "preptime": 5,
            "cooktime": 15,
            "complexity": "Easy",
            "serves": 4,
            "intruduction": "Try our easy Thai prawn curry on a busy weeknight. This quick dinner is ready in under 20 minutes and flavoured with warming red Thai curry paste",
            "Nutrition": {
                "kcal": 203,
                "fat": 13,
                "saturates": 8,
                "carbs": 8,
                "sugars": 7,
                "fibre": 2,
                "protein": 13,
                "salt": 1.25
            },
            "Ingredients": [
                "1 tbsp vegetable oil",
                "1 onion, chopped",
                "1 tsp fresh root ginger",
                "1-2 tsp Thai red curry paste (we used Sharwood's)",
                "400g can chopped tomatoes",
                "50g sachet coconut cream",
                "400g raw frozen prawns",
                "coriander, chopped, to serve (optional)"
            ],
            "Method": [
                "Heat the oil in a medium saucepan. Tip in the onion and ginger, then cook for a few mins until softened. Stir in the curry paste, then cook for 1 min more. Pour over the chopped tomatoes and coconut cream. Bring to the boil, then leave to simmer for 5 mins, adding a little boiling water if the mixture gets too thick.",
                "Tip in the prawns, then cook for 5-10 mins more, depending on how large they are. Serve alongside some plain rice and sprinkle with a little chopped coriander, if you like."
            ]
        }
    ]
}